Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.0.28/svd/ATSAMRH707F18A.svd
<?xml version="1.0" encoding="UTF-8"?>
<!--
Copyright (c) 2017 Microchip Technology Inc.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
        schemaVersion="1.1"
        xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
   <vendor>Microchip Technology</vendor>
   <vendorID>MCHP</vendorID>
   <name>ATSAMRH707F18A</name>
   <series>SAMRH707</series>
   <version>0</version>
   <description>Microchip ATSAMRH707F18A Microcontroller</description>
   <cpu>
      <name>CM7</name>
      <revision>r1p1</revision>
      <endian>little</endian>
      <mpuPresent>true</mpuPresent>
      <fpuPresent>true</fpuPresent>
      <nvicPrioBits>3</nvicPrioBits>
      <vendorSystickConfig>false</vendorSystickConfig>
   </cpu>
   <addressUnitBits>8</addressUnitBits>
   <width>32</width>
   <size>32</size>
   <access>read-write</access>
   <resetValue>0x00000000</resetValue>
   <resetMask>0xFFFFFFFF</resetMask>
   <peripherals>
      <peripheral>
         <name>ADC</name>
         <version>44073K</version>
         <description>Analog-to-Digital Converter</description>
         <groupName>ADC</groupName>
         <prependToName>ADC_</prependToName>
         <baseAddress>0x40200000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xEC</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>ADC</name>
            <value>23</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <description>Control Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>START</name>
                     <description>Start Conversion</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPRST</name>
                     <description>Comparison Restart</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MR</name>
               <description>Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TRGEN</name>
                     <description>Trigger Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TRGENSelect</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Hardware triggers are disabled. Starting a conversion is only possible by software.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>Hardware trigger selected by TRGSEL is enabled. (rising mode selected)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRGSEL</name>
                     <description>Trigger Selection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>TRGSELSelect</name>
                        <enumeratedValue>
                           <name>ADC_TRIG0</name>
                           <description>ADTRG</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_TRIG1</name>
                           <description>TIOA0</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_TRIG2</name>
                           <description>TIOA1</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_TRIG3</name>
                           <description>TIOA2</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_TRIG4</name>
                           <description>PWM0 Event 0</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_TRIG5</name>
                           <description>PWM0 Event 1</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_TRIG6</name>
                           <description>PWM1 Event 0</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_TRIG7</name>
                           <description>PWM1 Event 1</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LOWRES</name>
                     <description>Low resolution</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LOWRESSelect</name>
                        <enumeratedValue>
                           <name>BITS_RESOLUTION</name>
                           <description>RESOLUTION-bit resolution.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BITS_RESOLUTION_2</name>
                           <description>RESOLUTION_2-bit resolution</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SLEEP</name>
                     <description>Sleep Mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SLEEPSelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Normal Mode: The ADC core and reference voltage circuitry are kept ON between conversions.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLEEP</name>
                           <description>Sleep Mode: The wakeup time can be modified by programming the FWUP bit.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FWUP</name>
                     <description>Fast Wakeup</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FWUPSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>If SLEEP is 1, then both ADC core and reference voltage circuitry are OFF between conversions</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>If SLEEP is 1, then Fast Wakeup Sleep mode: The voltage reference is ON between conversions and ADC core is OFF</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FREERUN</name>
                     <description>Free running</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FREERUNSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Normal Mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Free Run Mode: Never wait for any trigger.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PRESCAL</name>
                     <description>Prescaler Rate Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>STARTUP</name>
                     <description>Startup Time</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>STARTUPSelect</name>
                        <enumeratedValue>
                           <name>SUT0</name>
                           <description>0 periods of ADCCLK</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUT8</name>
                           <description>8 periods of ADCCLK</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUT16</name>
                           <description>16 periods of ADCCLK</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUT24</name>
                           <description>24 periods of ADCCLK</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUT64</name>
                           <description>64 periods of ADCCLK</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUT80</name>
                           <description>80 periods of ADCCLK</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUT96</name>
                           <description>96 periods of ADCCLK</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUT112</name>
                           <description>112 periods of ADCCLK</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUT512</name>
                           <description>512 periods of ADCCLK</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUT576</name>
                           <description>576 periods of ADCCLK</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUT640</name>
                           <description>640 periods of ADCCLK</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUT704</name>
                           <description>704 periods of ADCCLK</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUT768</name>
                           <description>768 periods of ADCCLK</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUT832</name>
                           <description>832 periods of ADCCLK</description>
                           <value>0xD</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUT896</name>
                           <description>896 periods of ADCCLK</description>
                           <value>0xE</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUT960</name>
                           <description>960 periods of ADCCLK</description>
                           <value>0xF</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SETTLING</name>
                     <description>Analog Settlings Time</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SETTLINGSelect</name>
                        <enumeratedValue>
                           <name>AST3</name>
                           <description>3 periods of ADCCLK</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AST5</name>
                           <description>5 periods of ADCCLK</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AST9</name>
                           <description>9 periods of ADCCLK</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AST17</name>
                           <description>17 periods of ADCCLK</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ANACH</name>
                     <description>Analog Change</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ANACHSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No analog change on channel switching: DIFF0, OFF0 and GAIN0 are used for all channels.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALLOWED</name>
                           <description>Allows different analog settings for each channel. See ADC_CGR and ADC_COR</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRACKTIM</name>
                     <description>Tracking Time</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TRANSFER</name>
                     <description>Transfer Time</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MAXSPEED</name>
                     <description>Maximum Sampling Rate Enable in Freerun Mode</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USEQ</name>
                     <description>User Sequence Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>USEQSelect</name>
                        <enumeratedValue>
                           <name>NUM_ORDER</name>
                           <description>Normal mode: The controller converts channels in a simple numeric order depending only on the channel index.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REG_ORDER</name>
                           <description>User Sequence mode: The sequence respects what is defined in ADC_SEQR1 and ADC_SEQR2 registers and can be used to convert the same channel several times.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SEQR1</name>
               <description>Channel Sequence Register 1</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>USCH1</name>
                     <description>User Sequence Number 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>USCH2</name>
                     <description>User Sequence Number 2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>USCH3</name>
                     <description>User Sequence Number 3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>USCH4</name>
                     <description>User Sequence Number 4</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>USCH5</name>
                     <description>User Sequence Number 5</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>USCH6</name>
                     <description>User Sequence Number 6</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>USCH7</name>
                     <description>User Sequence Number 7</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>USCH8</name>
                     <description>User Sequence Number 8</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
