Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.0.28/svd/ATSAMRH707F18A.svd
            <register>
               <name>EMR</name>
               <description>Extended Mode Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CMPMODE</name>
                     <description>Comparison Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CMPMODESelect</name>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>When the converted data is lower than the low threshold of the window, generates the ADC_ISR.COMPE flag or, in Partial Wakeup mode, defines the conditions to exit system from Wait mode.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>When the converted data is higher than the high threshold of the window, generates the ADC_ISR.COMPE flag or, in Partial Wakeup mode, defines the conditions to exit system from Wait mode.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IN</name>
                           <description>When the converted data is in the comparison window, generates the ADC_ISR.COMPE flag or, in Partial Wakeup mode, defines the conditions to exit system from Wait mode.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OUT</name>
                           <description>When the converted data is out of the comparison window, generates the ADC_ISR.COMPE flag or, in Partial Wakeup mode, defines the conditions to exit system from Wait mode.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMPTYPE</name>
                     <description>Comparison Type</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CMPTYPESelect</name>
                        <enumeratedValue>
                           <name>FLAG_ONLY</name>
                           <description>Any conversion is performed and comparison function drives the ADC_ISR.COMPE flag.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>START_CONDITION</name>
                           <description>Comparison conditions must be met to start the storage of all conversions until the ADC_CR.CMPRST bit is set.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMPSEL</name>
                     <description>Comparison Selected Channel</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CMPALL</name>
                     <description>Compare All Channels</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPFILTER</name>
                     <description>Compare Event Filtering</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSR</name>
                     <description>Over Sampling Rate</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>OSRSelect</name>
                        <enumeratedValue>
                           <name>NO_AVERAGE</name>
                           <description>No averaging. ADC sample rate is maximum.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR4</name>
                           <description>1-bit enhanced resolution by averaging. ADC sample rate divided by 4.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR16</name>
                           <description>2-bit enhanced resolution by averaging. ADC sample rate divided by 16.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR64</name>
                           <description>3-bit enhanced resolution by averaging. ADC sample rate divided by 64.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR256</name>
                           <description>4-bit enhanced resolution by averaging. ADC sample rate divided by 256.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASTE</name>
                     <description>Averaging on Single Trigger Event</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASTESelect</name>
                        <enumeratedValue>
                           <name>MULTI_TRIG_AVERAGE</name>
                           <description>The average requests several trigger events.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE_TRIG_AVERAGE</name>
                           <description>The average requests only one trigger event.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRACKX4</name>
                     <description>Tracking time x4</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TRACKX4Select</name>
                        <enumeratedValue>
                           <name>TRACK1</name>
                           <description>The ADC_MR.TRACKTIM field effect is multiplied by 1.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRACK4</name>
                           <description>The ADC_MR.TRACKTIM field effect is multiplied by 4.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TAG</name>
                     <description>Tag of ADC_LCDR</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADCMODE</name>
                     <description>ADC Running Mode</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>ADCMODESelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Normal mode of operation.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFFSET_ERROR</name>
                           <description>Offset Error mode to measure the offset error. See Table 7-6.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GAIN_ERROR_HIGH</name>
                           <description>Gain Error mode to measure the gain error. See Table 7-6.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GAIN_ERROR_LOW</name>
                           <description>Gain Error mode to measure the gain error. See Table 7-6.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CWR</name>
               <description>Compare Window Register</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LOWTHRES</name>
                     <description>Low Threshold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>HIGHTHRES</name>
                     <description>High Threshold</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
