Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.0.28/svd/ATSAMRH707F18A.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>CRCCU</name>
         <version>11001I</version>
         <description>Cyclic Redundancy Check Calculation Unit</description>
         <groupName>CRCCU</groupName>
         <prependToName>CRCCU_</prependToName>
         <baseAddress>0x40018000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x50</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>CRCCU</name>
            <value>22</value>
         </interrupt>
         <registers>
            <register>
               <name>DSCR</name>
               <description>CRCCU Descriptor Base Register</description>
               <addressOffset>0x000</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DSCR</name>
                     <description>Descriptor Base Address</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>23</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMA_EN</name>
               <description>CRCCU DMA Enable Register</description>
               <addressOffset>0x008</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DMAEN</name>
                     <description>DMA Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMA_DIS</name>
               <description>CRCCU DMA Disable Register</description>
               <addressOffset>0x00C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DMADIS</name>
                     <description>DMA Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMA_SR</name>
               <description>CRCCU DMA Status Register</description>
               <addressOffset>0x010</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DMASR</name>
                     <description>DMA Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMA_IER</name>
               <description>CRCCU DMA Interrupt Enable Register</description>
               <addressOffset>0x014</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DMAIER</name>
                     <description>Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMA_IDR</name>
               <description>CRCCU DMA Interrupt Disable Register</description>
               <addressOffset>0x018</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DMAIDR</name>
                     <description>Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMA_IMR</name>
               <description>CRCCU DMA Interrupt Mask Register</description>
               <addressOffset>0x001C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DMAIMR</name>
                     <description>Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMA_ISR</name>
               <description>CRCCU DMA Interrupt Status Register</description>
               <addressOffset>0x020</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DMAISR</name>
                     <description>Interrupt Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <description>CRCCU Control Register</description>
               <addressOffset>0x034</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RESET</name>
                     <description>CRC Computation Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MR</name>
               <description>CRCCU Mode Register</description>
               <addressOffset>0x038</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>CRC Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COMPARE</name>
                     <description>CRC Compare</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PTYPE</name>
                     <description>Primitive Polynomial</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>PTYPESelect</name>
                        <enumeratedValue>
                           <name>CCITT8023</name>
                           <description>Polynom 0x04C11DB7</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CASTAGNOLI</name>
                           <description>Polynom 0x1EDC6F41</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CCITT16</name>
                           <description>Polynom 0x1021</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIVIDER</name>
                     <description>Request Divider</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BITORDER</name>
                     <description>Precomputation Bit Swap Operation of the CRC</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BITORDERSelect</name>
                        <enumeratedValue>
                           <name>MSBFIRST</name>
                           <description>CRC computation is performed from the most significant bit to the least significant bit</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LSBFIRST</name>
                           <description>CRC computation is performed from the least significant bit to the most significant bit</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <description>CRCCU Status Register</description>
               <addressOffset>0x03C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CRC</name>
                     <description>Cyclic Redundancy Check Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <description>CRCCU Interrupt Enable Register</description>
               <addressOffset>0x040</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ERRIER</name>
                     <description>CRC Error Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDR</name>
               <description>CRCCU Interrupt Disable Register</description>
               <addressOffset>0x044</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ERRIDR</name>
                     <description>CRC Error Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IMR</name>
               <description>CRCCU Interrupt Mask Register</description>
               <addressOffset>0x048</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRIMR</name>
                     <description>CRC Error Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISR</name>
               <description>CRCCU Interrupt Status Register</description>
               <addressOffset>0x004C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRISR</name>
                     <description>CRC Error Interrupt Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
