Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.0.28/svd/ATSAMRH707F18A.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DACC</name>
         <version>6461L</version>
         <description>Digital-to-Analog Converter Controller</description>
         <groupName>DACC</groupName>
         <prependToName>DACC_</prependToName>
         <baseAddress>0x40014000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xEC</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>DACC</name>
            <value>24</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <description>Control Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MR</name>
               <description>Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TRGEN</name>
                     <description>Trigger Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TRGENSelect</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>External trigger mode disabled. DACC in free-running mode.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>External trigger mode enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRGSEL</name>
                     <description>Trigger Selection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>TRGSELSelect</name>
                        <enumeratedValue>
                           <name>TRGSEL0</name>
                           <description>External trigger</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRGSEL1</name>
                           <description>TIOA Output of the Timer Counter Channel 0</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRGSEL2</name>
                           <description>TIOA Output of the Timer Counter Channel 1</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRGSEL3</name>
                           <description>TIOA Output of the Timer Counter Channel 2</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRGSEL4</name>
                           <description>PWM Event Line 0</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRGSEL5</name>
                           <description>PWM Event Line 1</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WORD</name>
                     <description>Word Transfer</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WORDSelect</name>
                        <enumeratedValue>
                           <name>HALF</name>
                           <description>Half-word transfer</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WORD</name>
                           <description>Word transfer</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ONE</name>
                     <description>Must Be Set to 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER_SEL</name>
                     <description>User Channel Selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>USER_SELSelect</name>
                        <enumeratedValue>
                           <name>CHANNEL0</name>
                           <description>Channel 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHANNEL1</name>
                           <description>Channel 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHANNEL2</name>
                           <description>Channel 2</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TAG</name>
                     <description>Tag Selection Mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TAGSelect</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Tag selection mode disabled. Using USER_SEL to select the channel for the conversion.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>Tag selection mode enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MAXS</name>
                     <description>Maximum Speed Mode</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MAXSSelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Normal mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MAXIMUM</name>
                           <description>Maximum speed mode enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLKDIV</name>
                     <description>Shall be always write at '0'</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STARTUP</name>
                     <description>Startup Time Selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <name>STARTUPSelect</name>
                        <enumeratedValue>
                           <name>_0</name>
                           <description>0 periods of peripheral clock</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8</name>
                           <description>8 periods of peripheral clock</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16</name>
                           <description>16 periods of peripheral clock</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_24</name>
                           <description>24 periods of peripheral clock</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64</name>
                           <description>64 periods of peripheral clock</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_80</name>
                           <description>80 periods of peripheral clock</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_96</name>
                           <description>96 periods of peripheral clock</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_112</name>
                           <description>112 periods of peripheral clock</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_512</name>
                           <description>512 periods of peripheral clock</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_576</name>
                           <description>576 periods of peripheral clock</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_640</name>
                           <description>640 periods of peripheral clock</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_704</name>
                           <description>704 periods of peripheral clock</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_768</name>
                           <description>768 periods of peripheral clock</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_832</name>
                           <description>832 periods of peripheral clock</description>
                           <value>0xD</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_896</name>
                           <description>896 periods of peripheral clock</description>
                           <value>0xE</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_960</name>
                           <description>960 periods of peripheral clock</description>
                           <value>0xF</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1024</name>
                           <description>1024 periods of peripheral clock</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1088</name>
                           <description>1088 periods of peripheral clock</description>
                           <value>0x11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1152</name>
                           <description>1152 periods of peripheral clock</description>
                           <value>0x12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1216</name>
                           <description>1216 periods of peripheral clock</description>
                           <value>0x13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1280</name>
                           <description>1280 periods of peripheral clock</description>
                           <value>0x14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1344</name>
                           <description>1344 periods of peripheral clock</description>
                           <value>0x15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1408</name>
                           <description>1408 periods of peripheral clock</description>
                           <value>0x16</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1472</name>
                           <description>1472 periods of peripheral clock</description>
                           <value>0x17</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1536</name>
                           <description>1536 periods of peripheral clock</description>
                           <value>0x18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1600</name>
                           <description>1600 periods of peripheral clock</description>
                           <value>0x19</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1664</name>
                           <description>1664 periods of peripheral clock</description>
                           <value>0x1A</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1728</name>
                           <description>1728 periods of peripheral clock</description>
                           <value>0x1B</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1792</name>
                           <description>1792 periods of peripheral clock</description>
                           <value>0x1C</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1856</name>
                           <description>1856 periods of peripheral clock</description>
                           <value>0x1D</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1920</name>
                           <description>1920 periods of peripheral clock</description>
                           <value>0x1E</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1984</name>
                           <description>1984 periods of peripheral clock</description>
                           <value>0x1F</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2048</name>
                           <description>2048 periods of peripheral clock</description>
                           <value>0x20</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2112</name>
                           <description>2112 periods of peripheral clock</description>
                           <value>0x21</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2176</name>
                           <description>2176 periods of peripheral clock</description>
                           <value>0x22</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2240</name>
                           <description>2240 periods of peripheral clock</description>
                           <value>0x23</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2304</name>
                           <description>2304 periods of peripheral clock</description>
                           <value>0x24</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2368</name>
                           <description>2368 periods of peripheral clock</description>
                           <value>0x25</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2432</name>
                           <description>2432 periods of peripheral clock</description>
                           <value>0x26</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2496</name>
                           <description>2496 periods of peripheral clock</description>
                           <value>0x27</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2560</name>
                           <description>2560 periods of peripheral clock</description>
                           <value>0x28</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2624</name>
                           <description>2624 periods of peripheral clock</description>
                           <value>0x29</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2688</name>
                           <description>2688 periods of peripheral clock</description>
                           <value>0x2A</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2752</name>
                           <description>2752 periods of peripheral clock</description>
                           <value>0x2B</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2816</name>
                           <description>2816 periods of peripheral clock</description>
                           <value>0x2C</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2880</name>
                           <description>2880 periods of peripheral clock</description>
                           <value>0x2D</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2944</name>
                           <description>2944 periods of peripheral clock</description>
                           <value>0x2E</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3008</name>
                           <description>3008 periods of peripheral clock</description>
                           <value>0x2F</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3072</name>
                           <description>3072 periods of peripheral clock</description>
                           <value>0x30</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3136</name>
                           <description>3136 periods of peripheral clock</description>
                           <value>0x31</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3200</name>
                           <description>3200 periods of peripheral clock</description>
                           <value>0x32</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3264</name>
                           <description>3264 periods of peripheral clock</description>
                           <value>0x33</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3328</name>
                           <description>3328 periods of peripheral clock</description>
                           <value>0x34</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3392</name>
                           <description>3392 periods of peripheral clock</description>
                           <value>0x35</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3456</name>
                           <description>3456 periods of peripheral clock</description>
                           <value>0x36</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3520</name>
                           <description>3520 periods of peripheral clock</description>
                           <value>0x37</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3584</name>
                           <description>3584 periods of peripheral clock</description>
                           <value>0x38</value>
                        </enumeratedValue>
                        <enumeratedValue>
