Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.0.28/svd/ATSAMRH707F18A.svd
            <register>
               <name>FLEX_SPI_IMR</name>
               <description>SPI Interrupt Mask Register</description>
               <addressOffset>0x41C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RDRF</name>
                     <description>Receive Data Register Full Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDRE</name>
                     <description>SPI Transmit Data Register Empty Interrupt Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MODF</name>
                     <description>Mode Fault Error Interrupt Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRES</name>
                     <description>Overrun Error Interrupt Mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NSSR</name>
                     <description>NSS Rising Interrupt Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Transmission Registers Empty Mask</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDES</name>
                     <description>Underrun Error Interrupt Mask</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP</name>
                     <description>Comparison Interrupt Mask</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFEF</name>
                     <description>TXFEF Interrupt Mask</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFFF</name>
                     <description>TXFFF Interrupt Mask</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFTHF</name>
                     <description>TXFTHF Interrupt Mask</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFEF</name>
                     <description>RXFEF Interrupt Mask</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFFF</name>
                     <description>RXFFF Interrupt Mask</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFTHF</name>
                     <description>RXFTHF Interrupt Mask</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFPTEF</name>
                     <description>TXFPTEF Interrupt Mask</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFPTEF</name>
                     <description>RXFPTEF Interrupt Mask</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>FLEX_SPI_CSR[%s]</name>
               <description>SPI Chip Select Register</description>
               <addressOffset>0x430</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CPOL</name>
                     <description>Clock Polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NCPHA</name>
                     <description>Clock Phase</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSNAAT</name>
                     <description>Chip Select Not Active After Transfer (Ignored if CSAAT = 1)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSAAT</name>
                     <description>Chip Select Active After Transfer</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BITS</name>
                     <description>Bits Per Transfer</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>BITSSelect</name>
                        <enumeratedValue>
                           <name>8_BIT</name>
                           <description>8 bits for transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>9_BIT</name>
                           <description>9 bits for transfer</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10_BIT</name>
                           <description>10 bits for transfer</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11_BIT</name>
                           <description>11 bits for transfer</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>12_BIT</name>
                           <description>12 bits for transfer</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>13_BIT</name>
                           <description>13 bits for transfer</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>14_BIT</name>
                           <description>14 bits for transfer</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>15_BIT</name>
                           <description>15 bits for transfer</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16_BIT</name>
                           <description>16 bits for transfer</description>
                           <value>0x8</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SCBR</name>
                     <description>Serial Clock Bit Rate</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DLYBS</name>
                     <description>Delay Before SPCK</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DLYBCT</name>
                     <description>Delay Between Consecutive Transfers</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_SPI_FMR</name>
               <description>SPI FIFO Mode Register</description>
               <addressOffset>0x440</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXRDYM</name>
                     <description>Transmit Data Register Empty Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TXRDYMSelect</name>
                        <enumeratedValue>
                           <name>ONE_DATA</name>
                           <description>TDRE will be at level '1' when at least one data can be written in the Transmit FIFO.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWO_DATA</name>
                           <description>TDRE will be at level '1' when at least two data can be written in the Transmit FIFO. Cannot be used if FLEX_SPI_MR.PS =1.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXRDYM</name>
                     <description>Receive Data Register Full Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>RXRDYMSelect</name>
                        <enumeratedValue>
                           <name>ONE_DATA</name>
                           <description>RDRF will be at level '1' when at least one unread data is in the Receive FIFO.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWO_DATA</name>
                           <description>RDRF will be at level '1' when at least two unread data are in the Receive FIFO. Cannot be used when FLEX_SPI_MR.MSTR =1, or if FLEX_SPI_MR.PS =1.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FOUR_DATA</name>
                           <description>RDRF will be at level '1' when at least four unread data are in the Receive FIFO. Cannot be used when FLEX_SPI_CSRx.BITS is greater than 0, or if FLEX_SPI_MR.MSTR =1, or if FLEX_SPI_MR.PS =1.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXFTHRES</name>
                     <description>Transmit FIFO Threshold</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RXFTHRES</name>
                     <description>Receive FIFO Threshold</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_SPI_FLR</name>
               <description>SPI FIFO Level Register</description>
               <addressOffset>0x444</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXFL</name>
                     <description>Transmit FIFO Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RXFL</name>
                     <description>Receive FIFO Level</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_SPI_CMPR</name>
               <description>SPI Comparison Register</description>
               <addressOffset>0x448</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VAL1</name>
                     <description>First Comparison Value for Received Character</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>VAL2</name>
                     <description>Second Comparison Value for Received Character</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_SPI_WPMR</name>
               <description>SPI Write Protection Mode Register</description>
               <addressOffset>0x4E4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPITEN</name>
                     <description>Write Protection Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPCREN</name>
                     <description>Write Protection Control Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of bits WPEN, WPITEN and WPCREN. Always reads as 0</description>
                           <value>0x535049</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_SPI_WPSR</name>
               <description>SPI Write Protection Status Register</description>
               <addressOffset>0x4E8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_CR</name>
               <description>TWI Control Register</description>
               <addressOffset>0x600</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>START</name>
                     <description>Send a START Condition</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STOP</name>
                     <description>Send a STOP Condition</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSEN</name>
                     <description>TWI Master Mode Enabled</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSDIS</name>
                     <description>TWI Master Mode Disabled</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SVEN</name>
                     <description>TWI Slave Mode Enabled</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SVDIS</name>
                     <description>TWI Slave Mode Disabled</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>QUICK</name>
                     <description>SMBus Quick Command</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSEN</name>
                     <description>TWI High-Speed Mode Enabled</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSDIS</name>
                     <description>TWI High-Speed Mode Disabled</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMBEN</name>
                     <description>SMBus Mode Enabled</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMBDIS</name>
                     <description>SMBus Mode Disabled</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PECEN</name>
                     <description>Packet Error Checking Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PECDIS</name>
                     <description>Packet Error Checking Disable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PECRQ</name>
                     <description>PEC Request</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLEAR</name>
                     <description>Bus CLEAR Command</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACMEN</name>
                     <description>Alternative Command Mode Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACMDIS</name>
                     <description>Alternative Command Mode Disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>THRCLR</name>
                     <description>Transmit Holding Register Clear</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKCLR</name>
                     <description>Lock Clear</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOEN</name>
                     <description>FIFO Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFODIS</name>
                     <description>FIFO Disable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
