Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.0.28/svd/ATSAMRH707F18A.svd
            <register>
               <name>FLEX_TWI_RHR</name>
               <description>TWI Receive Holding Register</description>
               <addressOffset>0x630</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXDATA</name>
                     <description>Master or Slave Receive Holding Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SSTATE</name>
                     <description>Start State (Slave Sniffer Mode only)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SSTATESelect</name>
                        <enumeratedValue>
                           <name>NOSTART</name>
                           <description>No START detected with the logged data</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>START</name>
                           <description>START (S) detected with the logged data</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RSTART</name>
                           <description>Repeated START (Sr) detected with the logged data</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNDEF</name>
                           <description>Not defined</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PSTATE</name>
                     <description>Stop State (Slave Sniffer Mode only)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ASTATE</name>
                     <description>Acknowledge State (Slave Sniffer Mode only)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>ASTATESelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Acknowledge or Nacknowledge detected after previously logged data</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACK</name>
                           <description>Acknowledge (A) detected after previously logged data</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NACK</name>
                           <description>Nacknowledge (NA) detected after previously logged data</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNDEF</name>
                           <description>Not defined</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_RHR_FIFO_ENABLED_MODE</name>
               <description>TWI Receive Holding Register</description>
               <alternateRegister>FLEX_TWI_RHR</alternateRegister>
               <addressOffset>0x630</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXDATA0</name>
                     <description>Master or Slave Receive Holding Data 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXDATA1</name>
                     <description>Master or Slave Receive Holding Data 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXDATA2</name>
                     <description>Master or Slave Receive Holding Data 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXDATA3</name>
                     <description>Master or Slave Receive Holding Data 3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_THR</name>
               <description>TWI Transmit Holding Register</description>
               <addressOffset>0x634</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TXDATA</name>
                     <description>Master or Slave Transmit Holding Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_THR_FIFO_ENABLED_MODE</name>
               <description>TWI Transmit Holding Register</description>
               <alternateRegister>FLEX_TWI_THR</alternateRegister>
               <addressOffset>0x634</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TXDATA0</name>
                     <description>Master or Slave Transmit Holding Data 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TXDATA1</name>
                     <description>Master or Slave Transmit Holding Data 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TXDATA2</name>
                     <description>Master or Slave Transmit Holding Data 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TXDATA3</name>
                     <description>Master or Slave Transmit Holding Data 3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_SMBTR</name>
               <description>TWI SMBus Timing Register</description>
               <addressOffset>0x638</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRESC</name>
                     <description>SMBus Clock Prescaler</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TLOWS</name>
                     <description>Slave Clock Stretch Maximum Cycles</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TLOWM</name>
                     <description>Master Clock Stretch Maximum Cycles</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>THMAX</name>
                     <description>Clock High Maximum Cycles</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_ACR</name>
               <description>TWI Alternative Command Register</description>
               <addressOffset>0x640</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DATAL</name>
                     <description>Data Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DIR</name>
                     <description>Transfer Direction</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEC</name>
                     <description>PEC Request (SMBus Mode only)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NDATAL</name>
                     <description>Next Data Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NDIR</name>
                     <description>Next Transfer Direction</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NPEC</name>
                     <description>Next PEC Request (SMBus Mode only)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_FILTR</name>
               <description>TWI Filter Register</description>
               <addressOffset>0x644</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FILT</name>
                     <description>RX Digital Filter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PADFEN</name>
                     <description>PAD Filter Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>THRES</name>
                     <description>Digital Filter Threshold</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_FMR</name>
               <description>TWI FIFO Mode Register</description>
               <addressOffset>0x650</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXRDYM</name>
                     <description>Transmitter Ready Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TXRDYMSelect</name>
                        <enumeratedValue>
                           <name>ONE_DATA</name>
                           <description>TXRDY will be at level '1' when at least one data can be written in the Transmit FIFO</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWO_DATA</name>
                           <description>TXRDY will be at level '1' when at least two data can be written in the Transmit FIFO</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FOUR_DATA</name>
                           <description>TXRDY will be at level '1' when at least four data can be written in the Transmit FIFO</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXRDYM</name>
                     <description>Receiver Ready Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>RXRDYMSelect</name>
                        <enumeratedValue>
                           <name>ONE_DATA</name>
                           <description>RXRDY will be at level '1' when at least one unread data is in the Receive FIFO</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWO_DATA</name>
                           <description>RXRDY will be at level '1' when at least two unread data are in the Receive FIFO</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FOUR_DATA</name>
                           <description>RXRDY will be at level '1' when at least four unread data are in the Receive FIFO</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXFTHRES</name>
                     <description>Transmit FIFO Threshold</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RXFTHRES</name>
                     <description>Receive FIFO Threshold</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_FLR</name>
               <description>TWI FIFO Level Register</description>
               <addressOffset>0x654</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXFL</name>
                     <description>Transmit FIFO Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RXFL</name>
                     <description>Receive FIFO Level</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_FSR</name>
               <description>TWI FIFO Status Register</description>
               <addressOffset>0x660</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXFEF</name>
                     <description>Transmit FIFO Empty Flag (cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFFF</name>
                     <description>Transmit FIFO Full Flag (cleared on read)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFTHF</name>
                     <description>Transmit FIFO Threshold Flag (cleared on read)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFEF</name>
                     <description>Receive FIFO Empty Flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFFF</name>
                     <description>Receive FIFO Full Flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFTHF</name>
                     <description>Receive FIFO Threshold Flag</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFPTEF</name>
                     <description>Transmit FIFO Pointer Error Flag</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFPTEF</name>
                     <description>Receive FIFO Pointer Error Flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_FIER</name>
               <description>TWI FIFO Interrupt Enable Register</description>
               <addressOffset>0x664</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TXFEF</name>
                     <description>TXFEF Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFFF</name>
                     <description>TXFFF Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFTHF</name>
                     <description>TXFTHF Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFEF</name>
                     <description>RXFEF Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFFF</name>
                     <description>RXFFF Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFTHF</name>
                     <description>RXFTHF Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFPTEF</name>
                     <description>TXFPTEF Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFPTEF</name>
                     <description>RXFPTEF Interrupt Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_FIDR</name>
               <description>TWI FIFO Interrupt Disable Register</description>
               <addressOffset>0x668</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TXFEF</name>
                     <description>TXFEF Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFFF</name>
                     <description>TXFFF Interrupt Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFTHF</name>
                     <description>TXFTHF Interrupt Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFEF</name>
                     <description>RXFEF Interrupt Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFFF</name>
                     <description>RXFFF Interrupt Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFTHF</name>
                     <description>RXFTHF Interrupt Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFPTEF</name>
                     <description>TXFPTEF Interrupt Disable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFPTEF</name>
                     <description>RXFPTEF Interrupt Disable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
