Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.0.28/svd/ATSAMRH707F18A.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM1</name>
         <baseAddress>0x40024000</baseAddress>
         <interrupt>
            <name>FLEXCOM1</name>
            <value>8</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM2</name>
         <baseAddress>0x40028000</baseAddress>
         <interrupt>
            <name>FLEXCOM2</name>
            <value>13</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM3</name>
         <baseAddress>0x4002C000</baseAddress>
         <interrupt>
            <name>FLEXCOM3</name>
            <value>14</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>FLEXRAMECC</name>
         <version>44124A</version>
         <description>FLEXRAMECC</description>
         <groupName>FLEXRAMECC</groupName>
         <prependToName>FLEXRAMECC_</prependToName>
         <baseAddress>0x40100600</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x24</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>FLEXRAMECC_INTFIX</name>
            <value>42</value>
         </interrupt>
         <interrupt>
            <name>FLEXRAMECC_INTNOFIX</name>
            <value>43</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <description>FLEXRAMECC Control Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ONE</name>
                     <description>Shall be always write at '1'</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_RD</name>
                     <description>test mode of ECC protection - read mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_WR</name>
                     <description>test mode of ECC protection - write mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_FIX_CPT</name>
                     <description>reset the fixable error counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_NOFIX_CPT</name>
                     <description>reset the un-fixable error counter</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TESTCB1</name>
               <description>FLEXRAMECC Test mode register 1</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB1</name>
                     <description>Test Check Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <description>FLEXRAMECC Status register</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MEM_FIX</name>
                     <description>Fixable error status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPT_FIX</name>
                     <description>5 bits counter</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OVER_FIX</name>
                     <description>counter overflow</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_NOFIX</name>
                     <description>Un-fixable error status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPT_NOFIX</name>
                     <description>5 bits counter</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OVER_NOFIX</name>
                     <description>counter overflow</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HES</name>
                     <description>Hardware Error Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TYPE</name>
                     <description>write or read access</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <description>FLEXRAMECC Interrupt Enable Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>MEM_FIX</name>
                     <description>Fixable error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_NOFIX</name>
                     <description>Un-fixable error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDR</name>
               <description>FLEXRAMECC Interrupt Disable Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>MEM_FIX</name>
                     <description>fixable error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_NOFIX</name>
                     <description>un-fixable error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IMR</name>
               <description>FLEXRAMECC Interrupt Mask Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MEM_FIX</name>
                     <description>fixable error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_NOFIX</name>
                     <description>un-fixable error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FAILAR</name>
               <description>FLEXRAMECC Fail address register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ADDRESS</name>
                     <description>address of the error detected</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FAILDR</name>
               <description>FLEXRAMECC Fail data register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>data error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
