Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.0.28/svd/ATSAMRH707F18A.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>HEMC</name>
         <version>44121A</version>
         <description>HEMC</description>
         <groupName>HEMC</groupName>
         <prependToName>HEMC_</prependToName>
         <baseAddress>0x40080000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x198</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>HEMC_INTSDRAMC</name>
            <value>59</value>
         </interrupt>
         <interrupt>
            <name>HEMC_INTFIX</name>
            <value>60</value>
         </interrupt>
         <interrupt>
            <name>HEMC_INTNOFIX</name>
            <value>61</value>
         </interrupt>
         <registers>
            <register>
               <name>CR_NCS0</name>
               <description>HEMC Control Register NCS 0</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ZERO</name>
                     <description>fixed to 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BANKSIZE</name>
                     <description>Bank Size</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <name>BANKSIZESelect</name>
                        <enumeratedValue>
                           <name>_8KB</name>
                           <description>8Kbytes</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16KB</name>
                           <description>16Kbytes</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32KB</name>
                           <description>32Kbytes</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64KB</name>
                           <description>64Kbytes</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_128KB</name>
                           <description>128Kbytes</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256KB</name>
                           <description>256Kbytes</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_512KB</name>
                           <description>512Kbytes</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1MB</name>
                           <description>1Mbytes</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2MB</name>
                           <description>2Mbytes</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_USED</name>
                           <description>NOT_USED</description>
                           <value>0x1F</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TYPE</name>
                     <description>type of memory used</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDBASE</name>
                     <description>relative base address of NCS area</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
                  <field>
                     <name>WRITE_ECC_CONF</name>
                     <description>ECC Configuration Protection Enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC_ENABLE</name>
                     <description>ECC Protection Enable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR_NCS1</name>
               <description>HEMC Control Register NCS 1</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ZERO</name>
                     <description>fixed to 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BANKSIZE</name>
                     <description>Bank Size</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <name>BANKSIZESelect</name>
                        <enumeratedValue>
                           <name>_8KB</name>
                           <description>8Kbytes</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16KB</name>
                           <description>16Kbytes</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32KB</name>
                           <description>32Kbytes</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64KB</name>
                           <description>64Kbytes</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_128KB</name>
                           <description>128Kbytes</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256KB</name>
                           <description>256Kbytes</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_512KB</name>
                           <description>512Kbytes</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1MB</name>
                           <description>1Mbytes</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2MB</name>
                           <description>2Mbytes</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_USED</name>
                           <description>NOT_USED</description>
                           <value>0x1F</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TYPE</name>
                     <description>type of memory used</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDBASE</name>
                     <description>relative base address of NCS area</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
                  <field>
                     <name>ECC_ENABLE</name>
                     <description>ECC Protection Enable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRL</name>
               <description>HEMC Polarity Control register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>POL</name>
                     <description>External control buffer active polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>CRP_NCS[%s]</name>
               <description>HEMC Control Register Protection NCS</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASTERNUMBER</name>
                     <description>Master Number ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>SUPERUSER</name>
                     <description>User or Superuser access</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WR</name>
                     <description>Write Access</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RD</name>
                     <description>Read Access</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPLITBANKSIZE</name>
                     <description>bank size internal separation</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PROTECTZONE</name>
                     <description>select area protected</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROTECTON</name>
                     <description>protection activation</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <description>HEMC Interrupt Enable Register</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>OUTOFRANGE</name>
                     <description>out of range</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDERRORACCESS</name>
                     <description>read access error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRERRORACCESS</name>
                     <description>write access error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERERRORACCESS</name>
                     <description>user or superuser access error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDR</name>
               <description>HEMC Interrupt Disable Register</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>OUTOFRANGE</name>
                     <description>out of range</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDERRORACCESS</name>
                     <description>read access error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRERRORACCESS</name>
                     <description>write access error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERERRORACCESS</name>
                     <description>user or superuser access error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IMR</name>
               <description>HEMC Interrupt Mask Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>OUTOFRANGE</name>
                     <description>out of range</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDERRORACCESS</name>
                     <description>read access error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRERRORACCESS</name>
                     <description>write access error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERERRORACCESS</name>
                     <description>user or superuser access error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISR</name>
               <description>HEMC Interrupt Status Register</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>OUTOFRANGE</name>
                     <description>out of range</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDERRORACCESS</name>
                     <description>read access error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRERRORACCESS</name>
                     <description>Write access error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERERRORACCESS</name>
                     <description>User or SuperUser Error Access</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <description>HEMC Status Register</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>OUTOFRANGE</name>
                     <description>out of range</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDERRORACCESS</name>
                     <description>Read access error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRERRORACCESS</name>
                     <description>Write access error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERERRORACCESS</name>
                     <description>User or SuperUser Error Access</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HECC_CR</name>
               <description>HECC Control Register Channel 0 (HSMC)</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TEST_MODE_RD</name>
                     <description>test mode of ECC protection - read mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_WR</name>
                     <description>test mode of ECC protection - write mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_FIX_CPT</name>
                     <description>reset the fixable error counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_NOFIX_CPT</name>
                     <description>reset the un-fixable error counter</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HECC_TESTCB</name>
               <description>HECC Test mode Register Channel 0 (HSMC)</description>
               <addressOffset>0x140</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB1</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HECC_SR</name>
               <description>HECC Status Register</description>
               <addressOffset>0x180</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MEM_FIX</name>
                     <description>Fixable error status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPT_FIX</name>
                     <description>5 bits counter</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OVER_FIX</name>
                     <description>counter overflow</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_NOFIX</name>
                     <description>Un-fixable error status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPT_NOFIX</name>
                     <description>5 bits counter</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OVER_NOFIX</name>
                     <description>counter overflow</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HES</name>
                     <description>Hardware Error Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TYPE</name>
                     <description>write or read access</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
