Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.0.28/svd/ATSAMRH707F18A.svd
            <register>
               <name>SCFG4R</name>
               <description>Source Configuration Register 4</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GFSEL</name>
                     <description>Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GFEN</name>
                     <description>Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>Polarity (POL bit is read-only in NMIC_SCFG1 to 8)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVL</name>
                     <description>Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Source Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRZ</name>
                     <description>Interrupt Line Freeze</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCFG5R</name>
               <description>Source Configuration Register 5</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GFSEL</name>
                     <description>Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GFEN</name>
                     <description>Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>Polarity (POL bit is read-only in NMIC_SCFG1 to 8)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVL</name>
                     <description>Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Source Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRZ</name>
                     <description>Interrupt Line Freeze</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCFG6R</name>
               <description>Source Configuration Register 6</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GFSEL</name>
                     <description>Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GFEN</name>
                     <description>Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>Polarity (POL bit is read-only in NMIC_SCFG1 to 8)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVL</name>
                     <description>Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Source Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRZ</name>
                     <description>Interrupt Line Freeze</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCFG7R</name>
               <description>Source Configuration Register 7</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GFSEL</name>
                     <description>Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GFEN</name>
                     <description>Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>Polarity (POL bit is read-only in NMIC_SCFG1 to 8)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVL</name>
                     <description>Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Source Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRZ</name>
                     <description>Interrupt Line Freeze</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCFG8R</name>
               <description>Source Configuration Register 8</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GFSEL</name>
                     <description>Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GFEN</name>
                     <description>Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>Polarity (POL bit is read-only in NMIC_SCFG1 to 8)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVL</name>
                     <description>Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Source Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRZ</name>
                     <description>Interrupt Line Freeze</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPCFEN</name>
                     <description>Write Protection Configuration Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPITEN</name>
                     <description>Write Protection Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPCFEN and WPITEN bit. Always reads as 0.</description>
                           <value>0x4E4D49</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0xE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Register Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FZWVS</name>
                     <description>Frozen Register Write Violation Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BSWVS</name>
                     <description>Busy Register Write Violation Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WVSRC</name>
                     <description>Write Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
