Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.0.28/svd/ATSAMRH707F18A.svd
            <register>
               <name>CSR1</name>
               <description>Peripheral Clock Status Register 1</description>
               <addressOffset>0x0174</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PID32</name>
                     <description>Peripheral Clock 32 Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID33</name>
                     <description>Peripheral Clock 33 Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID36</name>
                     <description>Peripheral Clock 36 Status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID38</name>
                     <description>Peripheral Clock 38 Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID44</name>
                     <description>Peripheral Clock 44 Status</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID45</name>
                     <description>Peripheral Clock 45 Status</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID50</name>
                     <description>Peripheral Clock 50 Status</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID53</name>
                     <description>Peripheral Clock 53 Status</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID54</name>
                     <description>Peripheral Clock 54 Status</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID55</name>
                     <description>Peripheral Clock 55 Status</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID59</name>
                     <description>Peripheral Clock 59 Status</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID63</name>
                     <description>Peripheral Clock 63 Status</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR2</name>
               <description>Peripheral Clock Status Register 2</description>
               <addressOffset>0x0178</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PID64</name>
                     <description>Peripheral Clock 64 Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID65</name>
                     <description>Peripheral Clock 65 Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID66</name>
                     <description>Peripheral Clock 66 Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID68</name>
                     <description>Peripheral Clock 68 Status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR3</name>
               <description>Peripheral Clock Status Register 3</description>
               <addressOffset>0x017C</addressOffset>
               <size>32</size>
               <access>read-only</access>
            </register>
            <register>
               <name>GCSR0</name>
               <description>Generic Clock Status Register 0</description>
               <addressOffset>0x0190</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>GPID7</name>
                     <description>Generic Clock 7 Status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPID8</name>
                     <description>Generic Clock 8 Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPID9</name>
                     <description>Generic Clock 9 Status</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPID13</name>
                     <description>Generic Clock 13 Status</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPID14</name>
                     <description>Generic Clock 14 Status</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPID23</name>
                     <description>Generic Clock 23 Status</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPID25</name>
                     <description>Generic Clock 25 Status</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPID28</name>
                     <description>Generic Clock 28 Status</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GCSR1</name>
               <description>Generic Clock Status Register 1</description>
               <addressOffset>0x0194</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>GPID36</name>
                     <description>Generic Clock 36 Status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPID38</name>
                     <description>Generic Clock 38 Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPID50</name>
                     <description>Generic Clock 50 Status</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPID53</name>
                     <description>Generic Clock 53 Status</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GCSR2</name>
               <description>Generic Clock Status Register 2</description>
               <addressOffset>0x0198</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>GPID65</name>
                     <description>Generic Clock 65 Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPID66</name>
                     <description>Generic Clock 66 Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPID68</name>
                     <description>Generic Clock 68 Status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GCSR3</name>
               <description>Generic Clock Status Register 3</description>
               <addressOffset>0x019C</addressOffset>
               <size>32</size>
               <access>read-only</access>
            </register>
            <register>
               <name>OSC2</name>
               <description>Oscillator Control Register 2</description>
               <addressOffset>0x01B0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCRCF</name>
                     <description>2nd Oscillator Frequency Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OSCRCFSelect</name>
                        <enumeratedValue>
                           <name>_4_MHz</name>
                           <description>The 2nd RC oscillator frequency is at 4 MHz</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8_MHz</name>
                           <description>The 2nd RC oscillator frequency is at 8 MHz</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_10_MHz</name>
                           <description>The 2nd RC oscillator frequency is at 10 MHz</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_12_MHz</name>
                           <description>The 2nd RC oscillator frequency is at 12 MHz</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EN_WR_CALIB</name>
                     <description>Enable Calibration Register Write</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Register Write Access Password</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation.Always reads as 0.</description>
                           <value>0x37</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>OCR2</name>
               <description>Oscillator Calibration Register 2</description>
               <addressOffset>0x01B4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CAL4</name>
                     <description>Main RC Oscillator Calibration Bits for 4 MHz</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SEL4</name>
                     <description>Selection of Main RC Oscillator Calibration Bits for 4 MHz</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAL8</name>
                     <description>Main RC Oscillator Calibration Bits for 8 MHz</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SEL8</name>
                     <description>Selection of Main RC Oscillator Calibration Bits for 8 MHz</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAL12</name>
                     <description>Main RC Oscillator Calibration Bits for 12 MHz</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SEL12</name>
                     <description>Selection of Main RC Oscillator Calibration Bits for 12 MHz</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAL10</name>
                     <description>Main RC Oscillator Calibration Bits for 10 MHz</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SEL10</name>
                     <description>Selection of Main RC Oscillator Calibration Bits for 10 MHz</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
