Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.0.28/svd/ATSAMRH707F18A.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SHA</name>
         <version>6156O</version>
         <description>Secure Hash Algorithm</description>
         <groupName>SHA</groupName>
         <prependToName>SHA_</prependToName>
         <baseAddress>0x40094000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xEC</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SHA</name>
            <value>44</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <description>Control Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>START</name>
                     <description>Start Processing</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIRST</name>
                     <description>First Block of a Message</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WUIHV</name>
                     <description>Write User Initial Hash Values</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WUIEHV</name>
                     <description>Write User Initial or Expected Hash Values</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MR</name>
               <description>Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SMOD</name>
                     <description>Start Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SMODSelect</name>
                        <enumeratedValue>
                           <name>MANUAL_START</name>
                           <description>Manual mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AUTO_START</name>
                           <description>Auto mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IDATAR0_START</name>
                           <description>SHA_IDATAR0 access only mode (mandatory when DMA is used)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UIHV</name>
                     <description>User Initial Hash Value Registers</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UIEHV</name>
                     <description>User Initial or Expected Hash Value Registers</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALGO</name>
                     <description>SHA Algorithm</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>ALGOSelect</name>
                        <enumeratedValue>
                           <name>SHA1</name>
                           <description>SHA1 algorithm processed</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHA256</name>
                           <description>SHA256 algorithm processed</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHA384</name>
                           <description>SHA384 algorithm processed</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHA512</name>
                           <description>SHA512 algorithm processed</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHA224</name>
                           <description>SHA224 algorithm processed</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HMAC_SHA1</name>
                           <description>HMAC algorithm with SHA1 Hash processed</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HMAC_SHA256</name>
                           <description>HMAC algorithm with SHA256 Hash processed</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HMAC_SHA384</name>
                           <description>HMAC algorithm with SHA384 Hash processed</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HMAC_SHA512</name>
                           <description>HMAC algorithm with SHA512 Hash processed</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HMAC_SHA224</name>
                           <description>HMAC algorithm with SHA224 Hash processed</description>
                           <value>0xC</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DUALBUFF</name>
                     <description>Dual Input Buffer</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DUALBUFFSelect</name>
                        <enumeratedValue>
                           <name>INACTIVE</name>
                           <description>SHA_IDATARx and SHA_IODATARx cannot be written during processing of previous block.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACTIVE</name>
                           <description>SHA_IDATARx and SHA_IODATARx can be written during processing of previous block when SMOD value = 2. It speeds up the overall runtime of large files.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CHECK</name>
                     <description>Hash Check</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CHECKSelect</name>
                        <enumeratedValue>
                           <name>NO_CHECK</name>
                           <description>No check is performed</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHECK_EHV</name>
                           <description>Check is performed with expected hash stored in internal expected hash value registers.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHECK_MESSAGE</name>
                           <description>Check is performed with expected hash provided after the message.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CHKCNT</name>
                     <description>Check Counter</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <description>Interrupt Enable Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DATRDY</name>
                     <description>Data Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>URAD</name>
                     <description>Unspecified Register Access Detection Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHECKF</name>
                     <description>Check Done Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SECE</name>
                     <description>Safety Event Interrupt Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDR</name>
               <description>Interrupt Disable Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DATRDY</name>
                     <description>Data Ready Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>URAD</name>
                     <description>Unspecified Register Access Detection Interrupt Disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHECKF</name>
                     <description>Check Done Interrupt Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SECE</name>
                     <description>Safety Event Interrupt Disable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DATRDY</name>
                     <description>Data Ready Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>URAD</name>
                     <description>Unspecified Register Access Detection Interrupt Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHECKF</name>
                     <description>Check Done Interrupt Mask</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SECE</name>
                     <description>Safety Event Interrupt Mask</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISR</name>
               <description>Interrupt Status Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DATRDY</name>
                     <description>Data Ready (cleared by writing a 1 to bit SWRST or START in SHA_CR, or by reading SHA_IODATARx)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRDY</name>
                     <description>Input Data Register Write Ready</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>URAD</name>
                     <description>Unspecified Register Access Detection Status (cleared by writing a 1 to SWRST bit in SHA_CR)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>URAT</name>
                     <description>Unspecified Register Access Type (cleared by writing a 1 to SWRST bit in SHA_CR)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>CHECKF</name>
                     <description>Check Done Status (cleared by writing START or SWRST bits in SHA_CR or by reading SHA_IODATARx)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHKST</name>
                     <description>Check Status (cleared by writing START or SWRST bits in SHA_CR or by reading SHA_IODATARx)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SECE</name>
                     <description>Security and/or Safety Event</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSR</name>
               <description>Message Size Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MSGSIZE</name>
                     <description>Message Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BCR</name>
               <description>Bytes Count Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BYTCNT</name>
                     <description>Remaining Byte Count Before Auto Padding</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <name>IDATAR[%s]</name>
               <description>Input Data 0 Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>IDATA</name>
                     <description>Input Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <name>IODATAR[%s]</name>
               <description>Input/Output Data 0 Register</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IODATA</name>
                     <description>Input/Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Configuration Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPITEN</name>
                     <description>Write Protection Interruption Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPCREN</name>
                     <description>Write Protection Control Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN,WPITEN,WPCREN bits. Always reads as 0.</description>
                           <value>0x534841</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0xE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status (cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
