Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.0.28/svd/ATSAMRH707F18A.svd
            <register>
               <name>PKTRX1_PI_C</name>
               <description>PktRx Clear Pending Interrupt</description>
               <addressOffset>0x814</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DEACT</name>
                     <description>Deactivated</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOP</name>
                     <description>EOP seen</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEP</name>
                     <description>EEP seen</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISCARD</name>
                     <description>Packet Discard</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACT</name>
                     <description>Activated</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTRX1_IM_S</name>
               <description>PktRx Interrupt Set Mask</description>
               <addressOffset>0x818</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DEACT</name>
                     <description>Deactivated</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOP</name>
                     <description>EOP seen</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEP</name>
                     <description>EEP seen</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISCARD</name>
                     <description>Packet Discard</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACT</name>
                     <description>Activated</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTRX1_IM_C</name>
               <description>PktRx Interrupt Clear Mask</description>
               <addressOffset>0x81C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DEACT</name>
                     <description>Deactivated</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOP</name>
                     <description>EOP seen</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEP</name>
                     <description>EEP seen</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISCARD</name>
                     <description>Packet Discard</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACT</name>
                     <description>Activated</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTRX1_CFG</name>
               <description>PktRx Config</description>
               <addressOffset>0x820</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DISCARD</name>
                     <description>Discard</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTRX1_STATUS</name>
               <description>PktRx Status</description>
               <addressOffset>0x824</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Packet Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>PACKET</name>
                     <description>Packet</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKED</name>
                     <description>Locked</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARM</name>
                     <description>Armed</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACT</name>
                     <description>Active</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDING</name>
                     <description>Pending</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEACT</name>
                     <description>Deactivating</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTRX1_NXTBUFDATAADDR</name>
               <description>PktRx Next Buffer Data Address</description>
               <addressOffset>0x830</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTRX1_NXTBUFDATALEN</name>
               <description>PktRx Next Buffer Data Length</description>
               <addressOffset>0x834</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LEN</name>
                     <description>Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTRX1_NXTBUFPKTADDR</name>
               <description>PktRx Next Buffer Packet Address</description>
               <addressOffset>0x838</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTRX1_NXTBUFCFG</name>
               <description>PktRx Next Buffer Config</description>
               <addressOffset>0x83C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MAXCNT</name>
                     <description>Max Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>VALUE</name>
                     <description>Start Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>START</name>
                     <description>Start Mode</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>STARTSelect</name>
                        <enumeratedValue>
                           <name>STARTEVENT</name>
                           <description>Start if any bit in Start Value matches an incoming event</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STARTNOW</name>
                           <description>Start immediately. Request a deactivation on next packet boundary.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STARTTCH1</name>
                           <description>Start if Start Value matches an incoming Time Code from Time Code Handler 1</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STARTLATER</name>
                           <description>Start when Current Buffer is deactivated, e.g. by becoming full</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPLIT</name>
                     <description>Split Pkt</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTRX1_CURBUFDATAADDR</name>
               <description>PktRx Current Buffer Data Address</description>
               <addressOffset>0x840</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTRX1_CURBUFDATALEN</name>
               <description>PktRx Current Buffer Data Length</description>
               <addressOffset>0x844</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LEN</name>
                     <description>Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTRX1_CURBUFPKTADDR</name>
               <description>PktRx Current Buffer Packet Address</description>
               <addressOffset>0x848</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTRX1_CURBUFCFG</name>
               <description>PktRx Current Buffer Config</description>
               <addressOffset>0x84C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MAXCNT</name>
                     <description>Max Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>SPLIT</name>
                     <description>Split</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABORT</name>
                     <description>Abort</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTRX1_PREVBUFDATALEN</name>
               <description>PktRx Previous Buffer Data Length</description>
               <addressOffset>0x850</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LEN</name>
                     <description>Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTRX1_PREVBUFSTS</name>
               <description>PktRx Previous Buffer Status</description>
               <addressOffset>0x854</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>EEP</name>
                     <description>EEP seen</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FULLI</name>
                     <description>Buffer Info Full</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FULLD</name>
                     <description>Buffer Data Full</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAERR</name>
                     <description>DMA Error</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKED</name>
                     <description>Locked</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTRX1_SWRESET</name>
               <description>PktRx Software Reset</description>
               <addressOffset>0x87C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PATTERN</name>
                     <description>Pattern</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTTX1_PI_RM</name>
               <description>PktTx Pending Read Masked Interrupt</description>
               <addressOffset>0xC00</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DEACT</name>
                     <description>Deactivated</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACT</name>
                     <description>Activated</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOP</name>
                     <description>EOP sent</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEP</name>
                     <description>EEP sent</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTTX1_PI_R</name>
               <description>PktTx Pending Read Interrupt</description>
               <addressOffset>0xC08</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DEACT</name>
                     <description>Deactivated</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACT</name>
                     <description>Activated</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOP</name>
                     <description>EOP sent</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEP</name>
                     <description>EEP sent</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTTX1_PI_RCS</name>
               <description>PktTx Pending Read, Clear and Enabled Interrupt</description>
               <addressOffset>0xC0C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DEACT</name>
                     <description>Deactivated</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACT</name>
                     <description>Activated</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOP</name>
                     <description>EOP sent</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEP</name>
                     <description>EEP sent</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTTX1_IM</name>
               <description>PktTx Interrupt Mask</description>
               <addressOffset>0xC10</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DEACT</name>
                     <description>Deactivated</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACT</name>
                     <description>Activated</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOP</name>
                     <description>EOP sent</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEP</name>
                     <description>EEP sent</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTTX1_PI_C</name>
               <description>PktTx Clear Pending Interrupt</description>
               <addressOffset>0xC14</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DEACT</name>
                     <description>Deactivated</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACT</name>
                     <description>Activated</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOP</name>
                     <description>EOP sent</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEP</name>
                     <description>EEP sent</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
