Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.0.28/svd/ATSAMRH707F18A.svd
            <register>
               <name>PKTTX1_IM_S</name>
               <description>PktTx Interrupt Set Mask</description>
               <addressOffset>0xC18</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DEACT</name>
                     <description>Deactivated</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACT</name>
                     <description>Activated</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOP</name>
                     <description>EOP sent</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEP</name>
                     <description>EEP sent</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTTX1_IM_C</name>
               <description>PktTx Interrupt Clear Mask</description>
               <addressOffset>0xC1C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DEACT</name>
                     <description>Deactivated</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACT</name>
                     <description>Activated</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOP</name>
                     <description>EOP sent</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEP</name>
                     <description>EEP sent</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTTX1_STATUS</name>
               <description>PktTx Status</description>
               <addressOffset>0xC20</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ARM</name>
                     <description>Armed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACT</name>
                     <description>Active</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDING</name>
                     <description>Pending</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEACT</name>
                     <description>Deactivating</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PREV</name>
                     <description>Previous</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>PREVSelect</name>
                        <enumeratedValue>
                           <name>NOINFO</name>
                           <description>No information. Field not locked.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LASTSENDLISTOK</name>
                           <description>Last send list fully done</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ABORTEDMEMERR</name>
                           <description>Aborted due to memory access error.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ABORTEDNEWSD</name>
                           <description>Aborted by new send list.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ABORTEDUSERCMD</name>
                           <description>Aborted by direct user command.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ABORTEDTIMEOUT</name>
                           <description>Aborted by timeout.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTTX1_NXTSENDROUT</name>
               <description>PktTx Next Send List Router Bytes</description>
               <addressOffset>0xC24</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BYTE4</name>
                     <description>Byte4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BYTE3</name>
                     <description>Byte3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BYTE2</name>
                     <description>Byte2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BYTE1</name>
                     <description>Byte1</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTTX1_NXTSENDADDR</name>
               <description>PktTx Next Send List Address</description>
               <addressOffset>0xC28</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTTX1_NXTSENDCFG</name>
               <description>PktTx Next Send List Config</description>
               <addressOffset>0xC2C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LEN</name>
                     <description>Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>VALUE</name>
                     <description>Start Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>START</name>
                     <description>Start Mode</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>STARTSelect</name>
                        <enumeratedValue>
                           <name>STARTEVENT</name>
                           <description>Start if any bit in Start Value matches an incoming event</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STARTNOW</name>
                           <description>Start immediately, if possible</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STARTTCH1</name>
                           <description>Start if Start Value matches an incoming Time Code from Time Code Handler 1</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ABORT</name>
                     <description>Abort</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTTX1_CURSENDROUT</name>
               <description>PktTx Current Send List Router Bytes</description>
               <addressOffset>0xC30</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>BYTE4</name>
                     <description>Byte4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BYTE3</name>
                     <description>Byte3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BYTE2</name>
                     <description>Byte2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BYTE1</name>
                     <description>Byte1</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTTX1_CURSENDADDR</name>
               <description>PktTx Current Send List Address</description>
               <addressOffset>0xC34</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTTX1_CURSENDCFG</name>
               <description>PktTx Current Send List Config</description>
               <addressOffset>0xC38</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LEN</name>
                     <description>Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ABORT</name>
                     <description>Abort</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKTTX1_SWRESET</name>
               <description>PktTx Software Reset</description>
               <addressOffset>0xC3C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PATTERN</name>
                     <description>Pattern</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RMAP1_CFG</name>
               <description>SpW RMAP 1 Config</description>
               <addressOffset>0x00000E00</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DESTKEY</name>
                     <description>DestKey</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TLA</name>
                     <description>Address</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RMAPENA</name>
                     <description>RMAP Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RMAP1_STS_RC</name>
               <description>SpW RMAP 1 Read and Clear Status</description>
               <addressOffset>0x00000E04</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRCODE</name>
                     <description>Error Code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>ERRCODESelect</name>
                        <enumeratedValue>
                           <name>NOERROR</name>
                           <description>No error detected</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DMAERROR</name>
                           <description>Error while DMA accessing the internal bus, e.g. illegal address.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RMAPERROR</name>
                           <description>Unused RMAP command according to [RMAP]</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DESTKEYERROR</name>
                           <description>Destination key error</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATACRCERROR</name>
                           <description>Data CRC error</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EOPERROR</name>
                           <description>Early EOP in header or data, i.e. EOP has been received with less data than expected from the RMAP command header.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CARGOERROR</name>
                           <description>Cargo too large. Late EOP or EEP in data, i.e. EOP/EEP has been received with more data than expected from the RMAP command header.</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EEPERROR</name>
                           <description>Early EEP in data for RMAP commands. EEP has been received with less data or exactly as much as expected from the RMAP command header.</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CMDERROR</name>
                           <description>Authorisation error: Invalid or unsupported command.</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TLAERROR</name>
                           <description>Non-matching Target Logical Address.</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HEADERCRCERROR</name>
                           <description>Incorrect header CRC.</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PROTOCOLIDERROR</name>
                           <description>Protocol Identifier not supported.</description>
                           <value>0x11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REPLYADDERROR</name>
                           <description>Unsupported reply address length</description>
                           <value>0x12</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VALID</name>
                     <description>Valid</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RMAP1_STS</name>
               <description>SpW RMAP 1 Read Status</description>
               <addressOffset>0x00000E08</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRCODE</name>
                     <description>Error Code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>ERRCODESelect</name>
                        <enumeratedValue>
                           <name>NOERROR</name>
                           <description>No error detected</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DMAERROR</name>
                           <description>Error while DMA accessing the internal bus, e.g. illegal address.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RMAPERROR</name>
                           <description>Unused RMAP command according to [RMAP]</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DESTKEYERROR</name>
                           <description>Destination key error</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATACRCERROR</name>
                           <description>Data CRC error</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EOPERROR</name>
                           <description>Early EOP in header or data, i.e. EOP has been received with less data than expected from the RMAP command header.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CARGOERROR</name>
                           <description>Cargo too large. Late EOP or EEP in data, i.e. EOP/EEP has been received with more data than expected from the RMAP command header.</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EEPERROR</name>
                           <description>Early EEP in data for RMAP commands. EEP has been received with less data or exactly as much as expected from the RMAP command header.</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CMDERROR</name>
                           <description>Authorisation error: Invalid or unsupported command.</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TLAERROR</name>
                           <description>Non-matching Target Logical Address.</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HEADERCRCERROR</name>
                           <description>Incorrect header CRC.</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PROTOCOLIDERROR</name>
                           <description>Protocol Identifier not supported.</description>
                           <value>0x11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REPLYADDERROR</name>
                           <description>Unsupported reply address length</description>
                           <value>0x12</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VALID</name>
                     <description>Valid</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
