Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.0.28/svd/ATSAMRH707F18A.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>XDMAC</name>
         <version>11161N</version>
         <description>Extensible DMA Controller</description>
         <groupName>XDMAC</groupName>
         <prependToName>XDMAC_</prependToName>
         <baseAddress>0x40098000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x13D8</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>XDMAC</name>
            <value>64</value>
         </interrupt>
         <registers>
            <register>
               <name>GTYPE</name>
               <description>Global Type Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NB_CH</name>
                     <description>Number of Channels Minus One</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>FIFO_SZ</name>
                     <description>Number of Bytes</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>NB_REQ</name>
                     <description>Number of Peripheral Requests Minus One</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GCFG</name>
               <description>Global Configuration Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CGDISREG</name>
                     <description>Configuration Registers Clock Gating Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CGDISPIPE</name>
                     <description>Pipeline Clock Gating Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CGDISFIFO</name>
                     <description>FIFO Clock Gating Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CGDISIF</name>
                     <description>Bus Interface Clock Gating Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BXKBEN</name>
                     <description>Boundary X Kilobyte Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GWAC</name>
               <description>Global Weighted Arbiter Configuration Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PW0</name>
                     <description>Pool Weight 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PW1</name>
                     <description>Pool Weight 1</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PW2</name>
                     <description>Pool Weight 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PW3</name>
                     <description>Pool Weight 3</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GIE</name>
               <description>Global Interrupt Enable Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>IE0</name>
                     <description>XDMAC Channel 0 Interrupt Enable Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE1</name>
                     <description>XDMAC Channel 1 Interrupt Enable Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE2</name>
                     <description>XDMAC Channel 2 Interrupt Enable Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE3</name>
                     <description>XDMAC Channel 3 Interrupt Enable Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE4</name>
                     <description>XDMAC Channel 4 Interrupt Enable Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE5</name>
                     <description>XDMAC Channel 5 Interrupt Enable Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE6</name>
                     <description>XDMAC Channel 6 Interrupt Enable Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE7</name>
                     <description>XDMAC Channel 7 Interrupt Enable Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE8</name>
                     <description>XDMAC Channel 8 Interrupt Enable Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE9</name>
                     <description>XDMAC Channel 9 Interrupt Enable Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE10</name>
                     <description>XDMAC Channel 10 Interrupt Enable Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE11</name>
                     <description>XDMAC Channel 11 Interrupt Enable Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE12</name>
                     <description>XDMAC Channel 12 Interrupt Enable Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE13</name>
                     <description>XDMAC Channel 13 Interrupt Enable Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE14</name>
                     <description>XDMAC Channel 14 Interrupt Enable Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE15</name>
                     <description>XDMAC Channel 15 Interrupt Enable Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE16</name>
                     <description>XDMAC Channel 16 Interrupt Enable Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE17</name>
                     <description>XDMAC Channel 17 Interrupt Enable Bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE18</name>
                     <description>XDMAC Channel 18 Interrupt Enable Bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE19</name>
                     <description>XDMAC Channel 19 Interrupt Enable Bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE20</name>
                     <description>XDMAC Channel 20 Interrupt Enable Bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE21</name>
                     <description>XDMAC Channel 21 Interrupt Enable Bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE22</name>
                     <description>XDMAC Channel 22 Interrupt Enable Bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE23</name>
                     <description>XDMAC Channel 23 Interrupt Enable Bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE24</name>
                     <description>XDMAC Channel 24 Interrupt Enable Bit</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE25</name>
                     <description>XDMAC Channel 25 Interrupt Enable Bit</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE26</name>
                     <description>XDMAC Channel 26 Interrupt Enable Bit</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE27</name>
                     <description>XDMAC Channel 27 Interrupt Enable Bit</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE28</name>
                     <description>XDMAC Channel 28 Interrupt Enable Bit</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE29</name>
                     <description>XDMAC Channel 29 Interrupt Enable Bit</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE30</name>
                     <description>XDMAC Channel 30 Interrupt Enable Bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE31</name>
                     <description>XDMAC Channel 31 Interrupt Enable Bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GID</name>
               <description>Global Interrupt Disable Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ID0</name>
                     <description>XDMAC Channel 0 Interrupt Disable Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID1</name>
                     <description>XDMAC Channel 1 Interrupt Disable Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID2</name>
                     <description>XDMAC Channel 2 Interrupt Disable Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID3</name>
                     <description>XDMAC Channel 3 Interrupt Disable Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID4</name>
                     <description>XDMAC Channel 4 Interrupt Disable Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID5</name>
                     <description>XDMAC Channel 5 Interrupt Disable Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID6</name>
                     <description>XDMAC Channel 6 Interrupt Disable Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID7</name>
                     <description>XDMAC Channel 7 Interrupt Disable Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID8</name>
                     <description>XDMAC Channel 8 Interrupt Disable Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID9</name>
                     <description>XDMAC Channel 9 Interrupt Disable Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID10</name>
                     <description>XDMAC Channel 10 Interrupt Disable Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID11</name>
                     <description>XDMAC Channel 11 Interrupt Disable Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID12</name>
                     <description>XDMAC Channel 12 Interrupt Disable Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID13</name>
                     <description>XDMAC Channel 13 Interrupt Disable Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID14</name>
                     <description>XDMAC Channel 14 Interrupt Disable Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID15</name>
                     <description>XDMAC Channel 15 Interrupt Disable Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID16</name>
                     <description>XDMAC Channel 16 Interrupt Disable Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID17</name>
                     <description>XDMAC Channel 17 Interrupt Disable Bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID18</name>
                     <description>XDMAC Channel 18 Interrupt Disable Bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID19</name>
                     <description>XDMAC Channel 19 Interrupt Disable Bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID20</name>
                     <description>XDMAC Channel 20 Interrupt Disable Bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID21</name>
                     <description>XDMAC Channel 21 Interrupt Disable Bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID22</name>
                     <description>XDMAC Channel 22 Interrupt Disable Bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID23</name>
                     <description>XDMAC Channel 23 Interrupt Disable Bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID24</name>
                     <description>XDMAC Channel 24 Interrupt Disable Bit</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID25</name>
                     <description>XDMAC Channel 25 Interrupt Disable Bit</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID26</name>
                     <description>XDMAC Channel 26 Interrupt Disable Bit</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID27</name>
                     <description>XDMAC Channel 27 Interrupt Disable Bit</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID28</name>
                     <description>XDMAC Channel 28 Interrupt Disable Bit</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID29</name>
                     <description>XDMAC Channel 29 Interrupt Disable Bit</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID30</name>
                     <description>XDMAC Channel 30 Interrupt Disable Bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID31</name>
                     <description>XDMAC Channel 31 Interrupt Disable Bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
