Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.0.28/svd/ATSAMRH707F18A.svd
            <register>
               <name>GIM</name>
               <description>Global Interrupt Mask Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>IM0</name>
                     <description>XDMAC Channel 0 Interrupt Mask Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM1</name>
                     <description>XDMAC Channel 1 Interrupt Mask Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM2</name>
                     <description>XDMAC Channel 2 Interrupt Mask Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM3</name>
                     <description>XDMAC Channel 3 Interrupt Mask Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM4</name>
                     <description>XDMAC Channel 4 Interrupt Mask Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM5</name>
                     <description>XDMAC Channel 5 Interrupt Mask Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM6</name>
                     <description>XDMAC Channel 6 Interrupt Mask Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM7</name>
                     <description>XDMAC Channel 7 Interrupt Mask Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM8</name>
                     <description>XDMAC Channel 8 Interrupt Mask Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM9</name>
                     <description>XDMAC Channel 9 Interrupt Mask Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM10</name>
                     <description>XDMAC Channel 10 Interrupt Mask Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM11</name>
                     <description>XDMAC Channel 11 Interrupt Mask Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM12</name>
                     <description>XDMAC Channel 12 Interrupt Mask Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM13</name>
                     <description>XDMAC Channel 13 Interrupt Mask Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM14</name>
                     <description>XDMAC Channel 14 Interrupt Mask Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM15</name>
                     <description>XDMAC Channel 15 Interrupt Mask Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM16</name>
                     <description>XDMAC Channel 16 Interrupt Mask Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM17</name>
                     <description>XDMAC Channel 17 Interrupt Mask Bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM18</name>
                     <description>XDMAC Channel 18 Interrupt Mask Bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM19</name>
                     <description>XDMAC Channel 19 Interrupt Mask Bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM20</name>
                     <description>XDMAC Channel 20 Interrupt Mask Bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM21</name>
                     <description>XDMAC Channel 21 Interrupt Mask Bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM22</name>
                     <description>XDMAC Channel 22 Interrupt Mask Bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM23</name>
                     <description>XDMAC Channel 23 Interrupt Mask Bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM24</name>
                     <description>XDMAC Channel 24 Interrupt Mask Bit</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM25</name>
                     <description>XDMAC Channel 25 Interrupt Mask Bit</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM26</name>
                     <description>XDMAC Channel 26 Interrupt Mask Bit</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM27</name>
                     <description>XDMAC Channel 27 Interrupt Mask Bit</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM28</name>
                     <description>XDMAC Channel 28 Interrupt Mask Bit</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM29</name>
                     <description>XDMAC Channel 29 Interrupt Mask Bit</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM30</name>
                     <description>XDMAC Channel 30 Interrupt Mask Bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM31</name>
                     <description>XDMAC Channel 31 Interrupt Mask Bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GIS</name>
               <description>Global Interrupt Status Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>IS0</name>
                     <description>XDMAC Channel 0 Interrupt Status Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS1</name>
                     <description>XDMAC Channel 1 Interrupt Status Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS2</name>
                     <description>XDMAC Channel 2 Interrupt Status Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS3</name>
                     <description>XDMAC Channel 3 Interrupt Status Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS4</name>
                     <description>XDMAC Channel 4 Interrupt Status Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS5</name>
                     <description>XDMAC Channel 5 Interrupt Status Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS6</name>
                     <description>XDMAC Channel 6 Interrupt Status Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS7</name>
                     <description>XDMAC Channel 7 Interrupt Status Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS8</name>
                     <description>XDMAC Channel 8 Interrupt Status Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS9</name>
                     <description>XDMAC Channel 9 Interrupt Status Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS10</name>
                     <description>XDMAC Channel 10 Interrupt Status Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS11</name>
                     <description>XDMAC Channel 11 Interrupt Status Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS12</name>
                     <description>XDMAC Channel 12 Interrupt Status Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS13</name>
                     <description>XDMAC Channel 13 Interrupt Status Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS14</name>
                     <description>XDMAC Channel 14 Interrupt Status Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS15</name>
                     <description>XDMAC Channel 15 Interrupt Status Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS16</name>
                     <description>XDMAC Channel 16 Interrupt Status Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS17</name>
                     <description>XDMAC Channel 17 Interrupt Status Bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS18</name>
                     <description>XDMAC Channel 18 Interrupt Status Bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS19</name>
                     <description>XDMAC Channel 19 Interrupt Status Bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS20</name>
                     <description>XDMAC Channel 20 Interrupt Status Bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS21</name>
                     <description>XDMAC Channel 21 Interrupt Status Bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS22</name>
                     <description>XDMAC Channel 22 Interrupt Status Bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS23</name>
                     <description>XDMAC Channel 23 Interrupt Status Bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS24</name>
                     <description>XDMAC Channel 24 Interrupt Status Bit</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS25</name>
                     <description>XDMAC Channel 25 Interrupt Status Bit</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS26</name>
                     <description>XDMAC Channel 26 Interrupt Status Bit</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS27</name>
                     <description>XDMAC Channel 27 Interrupt Status Bit</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS28</name>
                     <description>XDMAC Channel 28 Interrupt Status Bit</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS29</name>
                     <description>XDMAC Channel 29 Interrupt Status Bit</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS30</name>
                     <description>XDMAC Channel 30 Interrupt Status Bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS31</name>
                     <description>XDMAC Channel 31 Interrupt Status Bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
